---
kind: property
id: P:Autodesk.Revit.DB.Electrical.ConduitSizeSettingIterator.CurrentObject
source: html/52c9f46e-e10e-a819-e34b-0ab98592fbc4.htm
---
# Autodesk.Revit.DB.Electrical.ConduitSizeSettingIterator.CurrentObject Property

## Syntax (C#)
```csharp
internal Object CurrentObject { get; }
```